Repository: mozilla-l10n/mt-training-data
Catalog: nmg/nmg_pontoon.tmx
Source language: en_us
Languages: nmg

source: Small batch sentence submission
nmg: Nlumb'la bwang mangoh bilwanga bibang

source: Source: { $sentenceSource }
nmg: Pe nlong vu : { $sentenceSource }

source: Speak
nmg: Lab

source: Speak now
nmg: Bi kuga na lab

source: Speak options menu
nmg: Ngoh mam masehga « lab » ri

source: Start recording
nmg: tahre nunga makyel.

source: <strong>[Crackle]</strong> giant dinosaurs of <strong>[crackle]</strong> -riassic.
nmg: <strong>[ bvung mbvuga ]</strong> minkā bongwombi bo <strong>[ bvung mbvuga ]</strong> -rias.

source: <strong>[Sneeze]</strong> The giant dinosaurs of the <strong>[cough]</strong> Triassic.
nmg: <strong>[ manumb'le ]</strong> minkilung bo dinozor <strong>[ kue ]</strong> Trias.

source: Submit
nmg: lumb'le

source: Submit a new question for the community to read and respond to
nmg: Bwang'sa tsia nwanah pe na kā langa na biang'sa ñe

source: Submit a report
nmg: lumb'le ndtande sal

source: Submit clips
nmg: Lumb'le nunga makyel

source: Submit new questions for the community to read and respond to
nmg: dzih botsia bowanah pe na bur bo kā bo langa na biang'sa bo

source: Success
nmg: kundā nsea

source: success checkmark
nmg: ndimbi liole na ye lang mpba

source: Swipe right to approve the sentence. Swipe left to reject it. Swipe up to skip it. <strong>Do not forget to submit your review!</strong>
nmg: tsinda mbwo magyal pe miāle lwanga-bibang. Tsinda mbwo magywum pe bina. Tsinda pe bvuo pe sa mpbi sa yā nyina le. <strong>ki nga wusa lumb'le mam bi zi tsendi !</strong>

source: Taking several attempts to read a word.
nmg: kiē pwā bikyen pe lang bang vur

source: Tap
nmg: Myama

source: Technology and Robotics
nmg: Teknoloya na robotik

source: Thank you for contributing your bulk submission!
nmg: Awa na mpbyambo bilwanga-bibang bi zi lumb'le

source: Thank you for contributing your voice!
nmg: Awa na len ma tsiung nwo

source: Thank you for donating your voice clips!
nmg: Awa na len' bipinde makyel gin'

source: Thank you for recording!<lineBreak></lineBreak>Now review and submit your clips below.
nmg: Awa na nunga makyel nwun' !<lineBreak></lineBreak>djihri bi kuga na miale na lumb'le bipinde bi yi pe si wa

source: Thank you for your voice information
nmg: Awa na mbuma pwo matsiung min'

source: The bumblebee sped by.
nmg: ñung nkwana nzimbo ma

source: The clip has disrespectful or offensive language.
nmg: pinde matsiung gina yi na bibang bi byanda na malu

source: The giant dinosaur of the Triassic.
nmg: nkā ngwombi ma Trias

source: The giant dinosaurs of the Triassi-.
nmg: minkā bongwombi bo Tria-

source: The giant dinosaurs of the Triassic.
nmg: minkā bongwombi bo Trias

source: The giant dinosaurs of the Triassic. <strong>[read by one voice]</strong>
nmg: minkā bongwombi bo Trias. <strong>[nlanga na tsiung matahra]</strong>

source: The giant dinosaurs of the Triassic. Yes.
nmg: minkā bongwombi bo Trias, Yang

source: The giant dino <strong>[cough]</strong> the Triassic.
nmg: nkā ngwombi <strong>[ kue ]</strong> Trias.

source: There are currently no sentences to review in this language.
nmg: Lwanga bibang dzinih pyal yā bele kyel gina wula gina ri

source: The recording was too long.
nmg: nunga makyel baleh gyowah

source: The recording was too quiet.
nmg: tsiung baleh be si

source: The recording was too short.
nmg: nunga makyel baleh vuloh

source: There will be natural variations in volume between readers. Reject only if the volume is so high that the recording breaks up, or (more commonly) if it is so low that you can’t hear what is being said without reference to the written text.
nmg: mbindela matsiung kuga na fang'la bo bunung ka bura bo lang . biā mia nwo ka ye yi nah nweh na mintsiga , to na (mpbi yi kuga na langah) ka ye baleh be nsila si ka na biā bele biā gywoēle sa zih labga kile dig gi yi ntsila,

source: The Sentence Collector is moving to the core Common Voice platform. You can now <writeURL>write</writeURL> a sentence or <reviewURL>review</reviewURL> single sentence submissions on Common Voice.
nmg: mpale bilwanga-bibang ñe nlumb'loh ma pe pinde-si ma Common Voice. Bi kuga djihri na <writeURL>tsile</writeURL> lwanga-bibang to nah <reviewURL>pyal</reviewURL> bilwanga-bibang bi yi bo Common Voice.

source: The sentence has a grammatical or spelling error.
nmg: lwanga-bibang gina bir mbvinda ntela bibang toh na mbvinda ntsila

source: The sentence has disrespectful or offensive language.
nmg: lwanga-bibang gina bir zwendala bibang na malu

source: The sentence must be grammatically correct.
nmg: bibang bi lwanga-bibang bi ywia na be ntela mpbeh

source: The sentence must be speakable.
nmg: Vi ywia na kuga pag lwanga-bibang

source: The sentence must be spelled correctly.
nmg: Lwanga-bibang ywia na tsiloh mpba

source: This information is optional to provide - you should only add it if you feel comfortable. When we release the dataset, we pseudonymise all personal information, and make sure information like your name and email are not connected to demographic information like age or sex.
nmg: Mbuma bopwo ywe kie wa nwo yi na nwuma nwo ; ywe kie nwo ka ywelepfuo wum'.Lin' vi kie mbuma pwo ma mur wa, vi sa nah toh mur ā dig sang'le ze yi tsina pfie, vi sa yā na mam mpbi dzina ye na ngobo bikalar bi nsyang nwo biā dig' lar na mbuma pwo mimbvu mye ka pamb'le kā mur ywe yi.

source: Three to go!
nmg: zāra bilal

source: Too many files
nmg: Puā mapiaga ma sal

source: Transcribe audio recordings into text
nmg: Tsile nunga makyel kyel yi nyiga piaga ri

source: Transcribe audio recordings in your language
nmg: Tsile nunga makyel kyel ye ri

source: Try again by dragging your file here
nmg: pong na kiē na kie pyaga sal ye wa

source: Try uploading again
nmg: kiga na lumb'le na

source: Understand contribution criteria
nmg: sang'le minwuma mi ngwela

source: Understand what to look for when listening to voice clips and help make your voice recordings richer too!
nmg: sang'la nga mam bi ywia na kiloh na mo lin' bi gywoele bipinde matsiung na bvul'gu nunga makyel nwun' mere

source: Upload aborted. Do you want to delete your recordings?
nmg: Makyel mā pong'le lumb'loh, ywe wum' mo pfimbi?

source: { $uploadedSentences } of { $totalSentences } sentences collected
nmg: { $uploadedSentences } bilwanga-bibang mimpala o { $totalSentences }

source: { $uploadedSentences } of { $totalSentences } sentences collected. Click <downloadLink>here</downloadLink> to download rejected sentences.
nmg: bilwanga-bibang mpala myama <downloadLink>here</downloadLink> Pe dang'le bilwanga-bibang bi zi mioh.

source: Upload failed, please retry.
nmg: Bilwanga-bibang biā pong'le lumb'loh

source: Upload <icon></icon> public domain sentences
nmg: lumb'le <icon></icon> lwanga-bibang bi mpā pub'liga

source: Upload in progress...
nmg: Vi nzih lumb'le

source: Upload more sentences?
nmg: Lumb'le bilwanga-bibang bifih?

source: Use correct grammar
nmg: Ntela bibang ywia na be nsea mpbeh

source: Use correct spelling and punctuation
nmg: Ntsila na bite bibang bi ywia na be nsea mpbeh

source: Validate Readings
nmg: myāle minlanga

source: Validate Readings, Review Transcriptions
nmg: miāle minlanga, pyal mintsila

source: Validate Readings <small>(Coming soon)</small>
nmg: myāle minlanga <small>(pil nfih)</small>

source: Validate readings submitted by community members
nmg: Miāle minlanga bur bo kā bo zi lumb'le

source: Validate user-recorded readings in your language
nmg: miāle minlanga mi yi mbāla bo bur bo lab kyel yin'

source: Varying Pronunciations
nmg: mpaga bibang mpbi fih

source: Volume
nmg: bindele tsiung

source: Want to save your information? <createProfile>Create a profile</createProfile>
nmg: Ywe wum' kwala mbuma bopwo nwo wa ? <createProfile>Te numa ye</createProfile>

source: We are going out to get a coffee.
nmg: ye yi ndzina, duo ki be na wung wu

source: We are going out to get coffee.
nmg: ye yi ndzina, duo ki be na wung

source: We couldn’t get any audio clips for you to listen to. Please try again later.
nmg: viā pong'le kuga na bwama bipinde makyel pe gywoēle. Bong nga kiē pil nfih.

source: We couldn’t get any sentences for you to speak. Please try again later.
nmg: Viā pongle shwambo bilwanga-bibang vi yi na mbvul pag, Pong na kiē pil nfih

source: We may have run out of clips - refresh the page, or try again later.
nmg: viā bele na na pinde makyel ma miāle kyel gina ri

source: We’re going out to get coffee.
nmg: yih ndzina, duo ki be na wung

source: We're making some big changes
nmg: Vi mua tsendi puā mam.

source: We’re sorry, your platform is not currently supported.
nmg: Bia Kiere, di pinde-si gin' ya pong'le mialoh

source: We've run out of sentences to record in this language...
nmg: Viā bele na na bilwanga-bibang vi kwala kyel gi na ri

source: We want the machine learning algorithms to able to handle a variety of background noise, and even relatively loud noises can be accepted provided that they don’t prevent you from hearing the entirety of the text. Quiet background music is OK; music loud enough to prevent you from hearing each and every word is not.
nmg: ye yi mpba na bo algorithm bo ngigsa bo sā mam na bo mere, bo bā na mbvul' kumbo lab bibvung bi pfie, To bibvung bi nenih bi kuga na gywugoh, Yi ywia sa koh na biā dig' djiole ngywuga ntsila, Bwang Mizik pfie vi kuga na miale mye , Di ka mi bvang'la bvubvu, via mialele

source: What issues are you experiencing with this sentence?
nmg: mimbvū ri minze ywe lar na mye lwanga-bibang gina ri?

source: What needs to be in my file?
nmg: Gi ñie ywia na be pyaga sal yang ri?

source: What sentences can I add?
nmg: lwanga-bibang ñie me kuga na kwala?

source: When listening, check very carefully that what has been recorded is exactly what has been written; reject if there are even minor errors. <br />Very common mistakes include:
nmg: lin' bi gywoēle, numa nga pyal nah makyel bi nung mo yā mo yi ntsila; mia nga mo ka mua mbvinda nwo yi tsina. <br /> mimbvina mi kweya na bebe mih mina:

source: Why are you asking?
nmg: Tsia ñina na puoē gi?

source: With a profile, you can keep track of your activity and connect with a community of voice data contributors.
nmg: Na numa ye, ywe kuga na ñina sal' ye na nih lwanga shuala bokwel bo le bipinde bopwo.

source: Write
nmg: Tsile

source: Write options menu
nmg: Mangoh ma mam ma sehga pe « Tsile »

source: Yes
nmg: yang

source: You can also use Keyboard Shortcuts: { sc-review-form-button-approve-shortcut } to Approve, { sc-review-form-button-reject-shortcut } to Reject, { sc-review-form-button-skip-shortcut } to Skip
nmg: bi kuga na biala na bitsil manzi pe lwanga matwen : { sc-review-form-button-approve-shortcut } pe miāle, { sc-review-form-button-reject-shortcut } pe bina, { sc-review-form-button-skip-shortcut } pe gye

source: You cannot add multiple sentences for a single submission
nmg: Biā bele na mbvul kwala mbyampbo bilwanga-bibang na lumb'le bibihya kyen vur

source: You have not selected any languages. Please go to your <profileLink>Profile</profileLink> to select languages.
nmg: Biā pong'le peh kyel dzinih. Nia nga pe <profileLink>numa ye</profileLink> pe peh makyel.

source: You have reached the submission limit for this page. Please wait for { $retryLimit } minutes before submitting another sentence. Thank you for your patience!
nmg: Ywe pan' ma nlih nlumb'la bilwanga-bibang pyaga gina ri. Bong zang'le { $retryLimit } mimpalah Shuoē na ywe lumb'le na bilwanga-bibang. Awa na ywe na zang'le!

source: You have reached the submission limit for this page. Please wait for { $retryLimit } seconds before submitting another sentence. Thank you for your patience!
nmg: Ywe pan' ma nlih nlumb'la bilwanga-bibang pyaga gina ri. Bong zang'le { $retryLimit } seconds Shuoē na ywe lumb'le na bilwanga-bibang. Awa na ywe na zang'le!!

source: You must allow microphone access.
nmg: Bi ywia na miāle na bo biala na mbire tsiung

source: You’re contributing to a target segment
nmg: bi le ngwala pe ngoh sal vi nlung'le

source: You’re contributing to our first target segment
nmg: bi le ngwala pe ngoh sal matahra vi nlung'le

source: You're going too fast. Please take a moment to review the sentence to make sure it's correct.
nmg: Bi baleh nga ke npfunde. Bong nga nung pil' pe bāla lang lwanga-bibang na numa pyal ka bi yi ntsila mpbeh.

source: You're helping Common Voice reach our daily sentence goals!
nmg: Bi kwel Common Voice na ñe lundela nwuma nwo pale bibang duo yiē duo

source: Your language variant might be out of clips! If you’re comfortable, you can change your settings to see other sentences within your language.
nmg: mpa-kyel ye giga na ki na be na lwanga-bibang, Di ka ywe wum, ywe kuga na tsendi mintela o pe kwala lwanga-bibang kyel ye ri.

source: Your language variant might be out of sentences! If you’re comfortable, you can change your settings to see other sentences within your language.
nmg: mpa-kyel ye giga na ki na be na lwanga-bibang, Di ka ywe wum, ywe kuga na tsendi mintela o pe kwala lwanga-bibang

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } recording goal!
nmg: Na ndang ywe Common Voice nlundele ma <goalPercentage></goalPercentage> nwuma nwo dol yi { $goalValue } nung bibang makyel !

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } validation goal!
nmg: Na ndang ywe Common Voice nlundele ma <goalPercentage></goalPercentage> nwuma nwo dol yi { $goalValue } miāle sal !
